# ACCESSING DATABASES FROM PANDAS

**Why bother?**

- While databases provide many analytical capabilities, often it’s useful to pull the data back into Python for more flexible programming.  
- Large, fixed operations would be more efficient in a database, but Pandas allows for interactive processing.
- For example, if you just want to aggregate login or sales data to present a report or dashboard, this operation is operating on a large dataset and not often changing.
- This would run very efficiently in a database vs connecting to Python.

**However, if we want to investigate the login or sales data further and ask more interactive questions, then using Python would come in very handy.**

- In this demonstration, we will create and connect to a SQLite database.  SQLite creates portable relational databases saved in a single file.
- These databases are stored in a very efficient manner and allow fast querying, making them ideal for small databases or databases that need to be moved across machines.
- Additionally, SQLite databases can be created with a similar setup to MySQL or Postgres databases.

### Real World Application

Every try to pull your text messages out of your iPhone?

Probably not .... but it's sitting there in a SQLite database

**We can create a SQLite databases as follows.**

In [1]:
import pandas as pd
from pandas.io import sql

In [2]:
import sqlite3

conn = sqlite3.connect('dat-test.db')
# This creates a file, dat-test.db, which will act as a relational/SQL database.

Data in Pandas can be loaded into a relational database.  For the most part, Pandas can use the databases column information to infer the schema for the table it creates.

Let’s return to the Rossmann sales data and load it into our database.

In [3]:
import pandas as pd

rossman = pd.read_csv('assets/dataset/rossmann.csv', low_memory=False)
rossman.head()

,Store,DayOfWeek,Date,Sales,Customers,Open,Promo,StateHoliday,SchoolHoliday
0,1,5,2015-07-31,5263,555,1,1,0,1
1,2,5,2015-07-31,6064,625,1,1,0,1
2,3,5,2015-07-31,8314,821,1,1,0,1
3,4,5,2015-07-31,13995,1498,1,1,0,1
4,5,5,2015-07-31,4822,559,1,1,0,1

**Data is moved to the database with the to_sql command, similar to the to_csv command.**

to_sql takes several arguments:
- name - the table name to create
- con - a connection to a database
- index - whether to input the index column
- schema - if we want to write a custom schema for the new table
- if_exists - what to do if the table already exists.  We can overwrite it, add to it, or fail

In [4]:
rossman.to_sql('rossmann_sales',
            con=conn,
            if_exists='replace',
            index=False)

### KNOWLEDGE CHECK

Load the Rossmann Store metadata in rossmann-stores.csv and create a table in the database with it.

In [5]:
rossman_stores = pd.read_csv('assets/dataset/rossmann-stores.csv', low_memory=False)
rossman_stores.head()

,Store,StoreType,Assortment,CompetitionDistance,CompetitionOpenSinceMonth,CompetitionOpenSinceYear,Promo2,Promo2SinceWeek,Promo2SinceYear,PromoInterval
0,1,c,a,1270.0,9.0,2008.0,0,NaN,NaN,NaN
1,2,a,a,570.0,11.0,2007.0,1,13.0,2010.0,"Jan,Apr,Jul,Oct"
2,3,a,a,14130.0,12.0,2006.0,1,14.0,2011.0,"Jan,Apr,Jul,Oct"
3,4,c,c,620.0,9.0,2009.0,0,NaN,NaN,NaN
4,5,a,a,29910.0,4.0,2015.0,0,NaN,NaN,NaN

In [6]:
rossman_stores.to_sql('rossman_stores',con=conn,if_exists='replace',index=False)

### Check table schema for `rossmann_sales`

In [7]:
sql.read_sql(
"""
PRAGMA table_info('rossmann_sales');
""", con=conn)

   cid           name     type  notnull dflt_value  pk
0    0          Store  INTEGER        0       None   0
1    1      DayOfWeek  INTEGER        0       None   0
2    2           Date     TEXT        0       None   0
3    3          Sales  INTEGER        0       None   0
4    4      Customers  INTEGER        0       None   0
5    5           Open  INTEGER        0       None   0
6    6          Promo  INTEGER        0       None   0
7    7   StateHoliday     TEXT        0       None   0
8    8  SchoolHoliday  INTEGER        0       None   0

### Query all columns in `rossmann_sales`

In [8]:
# Load data from DB
sql.read_sql('select * from rossmann_sales limit 5', con=conn)

,Store,DayOfWeek,Date,Sales,Customers,Open,Promo,StateHoliday,SchoolHoliday
0,1,5,2015-07-31,5263,555,1,1,0,1
1,2,5,2015-07-31,6064,625,1,1,0,1
2,3,5,2015-07-31,8314,821,1,1,0,1
3,4,5,2015-07-31,13995,1498,1,1,0,1
4,5,5,2015-07-31,4822,559,1,1,0,1

### KNOWLEDGE CHECK: 

Check table schema for `rossmann_stores`

In [10]:
sql.read_sql(
"""
PRAGMA table_info('rossman_stores');
""", con=conn)

   cid                       name     type  notnull dflt_value  pk
0    0                      Store  INTEGER        0       None   0
1    1                  StoreType     TEXT        0       None   0
2    2                 Assortment     TEXT        0       None   0
3    3        CompetitionDistance     REAL        0       None   0
4    4  CompetitionOpenSinceMonth     REAL        0       None   0
5    5   CompetitionOpenSinceYear     REAL        0       None   0
6    6                     Promo2  INTEGER        0       None   0
7    7            Promo2SinceWeek     REAL        0       None   0
8    8            Promo2SinceYear     REAL        0       None   0
9    9              PromoInterval     TEXT        0       None   0

### KNOWLEDGE CHECK: 
Query all columns in `rossmann_stores`

In [ ]:
# Load data from DB
### FILL IN ###

# DEMO: SQL SYNTAX:  SELECT, WHERE, GROUP BY, JOIN

**SQL OPERATORS:  SELECT**

Every query that retrieves data should start with SELECT.  SELECT is followed by the names of the columns in the output.

SELECT is always paired with FROM, which identifies the table to retrieve data from.

```
SELECT <columns>
FROM <table>
```

SELECT * denotes returning all of the columns.

Rossmann Stores example:

```
SELECT Store, Sales 
FROM rossmann_sales;
```

### KNOWLEDGE CHECK

Write a query for the Rossmann Sales data that returns Store, Date, and Customers.

**SQL OPERATORS:  WHERE**

WHERE is used to filter a table using a specific criteria.  The WHERE clause follows the FROM clause.

```
SELECT <columns>
FROM <table>
WHERE <condition>
```

The condition is some filter applied to the rows, where rows that match the condition will be output.

Rossmann Stores example:
```
SELECT Store, Sales 
FROM rossmann_sales
WHERE Store = 1;
```

```
SELECT Store, Sales 
FROM rossmann_sales
WHERE Store = 1 and Open = 1;
```

### KNOWLEDGE CHECK

Write a query for the Rossmann Sales data that returns Store, Date, and Customers for stores that were open and running a promotion.

**SQL OPERATORS:  GROUP BY**

GROUP BY allows us to aggregate over any field in the table by applying the concept of Split Apply Combine.  

We identify some key with which we want to segment the rows.  Then, we roll up or compute some statistics over all of the rows that match that key.

![](assets/images/split-apply-combine.png)

GROUP BY must be paired with an aggregate function, the statistic we want to compute in the rows, in the SELECT statement.

COUNT(*) denotes counting up all of the rows.  Other aggregate functions commonly available are AVG (average), MAX, MIN, and SUM.

If we want to aggregate over the entire table, without results specific to any key, we can use an aggregate function in the SELECT clause and ignore the GROUP BY clause.

Rossmann Stores example:

```
SELECT Store, SUM(Sales), AVG(Customers)
FROM rossmann_sales
GROUP BY Store
WHERE Open = 1;
```

### KNOWLEDGE CHECK

Write a query that returns the total sales on the promotion and non-promotion days.

**SQL OPERATORS:  ORDER BY**

ORDER BY is used to sort the results of a query.  

```
SELECT <columns>
FROM <table>
WHERE <condition>
ORDER BY <columns>
```

You can order by multiple columns in ascending (ASC) or descending (DESC) order.

Rossmann Stores example:

```
SELECT Store, SUM(Sales) as total_sales, AVG(Customers)
FROM rossmann_sales
GROUP BY Store
WHERE Open = 1;
ORDER BY total_sales desc;
```

COUNT(*) AS cnt renames the COUNT(*) value to cnt so we can refer to it later in the ORDER BY clause.

**SQL OPERATORS:  JOIN**

JOIN allows us to access data across many tables.  We specify how a row in one table links to another.

```
SELECT a.Store, a.Sales, s.CompetitionDistance
FROM rossmann_sales a
JOIN rossmann_stores s 
ON a.Store = s.Store
```

Here, ON denotes an inner join.

- By default, most joins are an Inner Join, which means only when there is a match in both tables does a row appear in the results.
- If we want to keep the rows of one table even if there is no matching counterpart, we can perform an Outer Join.  
- Outer joins can be LEFT, RIGHT, or FULL, meaning keep all of the left rows, all the right rows, or all the rows, respectively.

# INDEPENDENT PRACTICE: PANDAS AND SQL

- Load the Walmart sales and store features data.
- Create a table for each of those datasets.
- Select the store, date and fuel price on days it was over 90 degrees.
- Select the store, date and weekly sales and temperature.
- What were average sales on holiday vs. non-holiday sales?
- What were average sales on holiday vs. non-holiday sales when the temperature was below 32 degrees?

### 2.1 Load the Walmart sales and store features data

In [11]:
# Load the Walmart sales and store features data
walmart_sales = pd.read_csv('assets/dataset/walmart-sales.csv')
walmart_sales.head()

walmart_features = pd.read_csv('assets/dataset/features.csv')
walmart_features.head()

,Store,Date,Temperature,Fuel_Price,MarkDown1,MarkDown2,MarkDown3,MarkDown4,MarkDown5,CPI,Unemployment,IsHoliday
0,1,2010-02-05,42.31,2.572,NaN,NaN,NaN,NaN,NaN,211.096358,8.106,False
1,1,2010-02-12,38.51,2.548,NaN,NaN,NaN,NaN,NaN,211.242170,8.106,True
2,1,2010-02-19,39.93,2.514,NaN,NaN,NaN,NaN,NaN,211.289143,8.106,False
3,1,2010-02-26,46.63,2.561,NaN,NaN,NaN,NaN,NaN,211.319643,8.106,False
4,1,2010-03-05,46.50,2.625,NaN,NaN,NaN,NaN,NaN,211.350143,8.106,False

### 2.2 Create a table for each of those datasets

In [12]:
# Create a table for each of those datasets

walmart_sales.to_sql('walmart_sales',con=conn,if_exists='replace',index=False)
walmart_features.to_sql('walmart_features',con=conn,if_exists='replace',index=False)

In [13]:
sql.read_sql(
"""
PRAGMA table_info('walmart_sales');
""", con=conn)

   cid          name     type  notnull dflt_value  pk
0    0         Store  INTEGER        0       None   0
1    1          Dept  INTEGER        0       None   0
2    2          Date     TEXT        0       None   0
3    3  Weekly_Sales     REAL        0       None   0
4    4     IsHoliday  INTEGER        0       None   0

In [14]:
sql.read_sql(
"""
PRAGMA table_info('walmart_features');
""", con=conn)

    cid          name     type  notnull dflt_value  pk
0     0         Store  INTEGER        0       None   0
1     1          Date     TEXT        0       None   0
2     2   Temperature     REAL        0       None   0
3     3    Fuel_Price     REAL        0       None   0
4     4     MarkDown1     REAL        0       None   0
5     5     MarkDown2     REAL        0       None   0
6     6     MarkDown3     REAL        0       None   0
7     7     MarkDown4     REAL        0       None   0
8     8     MarkDown5     REAL        0       None   0
9     9           CPI     REAL        0       None   0
10   10  Unemployment     REAL        0       None   0
11   11     IsHoliday  INTEGER        0       None   0

### 2.3 Select the store, date and fuel price on days it was over 90 degrees

HINT: Use WHERE

In [15]:
# Select the store, date and fuel price on days it was over 90 degrees
query = """ 
SELECT Store, Date, Fuel_Price
FROM walmart_features
WHERE Temperature>90
"""
sql.read_sql(query, con = conn).head()

   Store        Date  Fuel_Price
0      1  2011-08-05       3.684
1      1  2011-08-12       3.638
2      2  2011-07-29       3.682
3      2  2011-08-05       3.684
4      2  2011-08-12       3.638

### 2.4 Select the store, date and weekly sales and temperature

HINT: Use JOIN

In [16]:
# Select the store, date and weekly sales and temperature
query = """
SELECT a.Store, a.Date, s.Weekly_Sales, a.Temperature
FROM walmart_features a
JOIN walmart_sales s 
ON a.Store = s.Store
"""
sql.read_sql(query, con = conn).head()

   Store        Date  Weekly_Sales  Temperature
0      1  2010-02-05        -863.0        42.31
1      1  2010-02-05        -698.0        42.31
2      1  2010-02-05        -498.0        42.31
3      1  2010-02-05        -498.0        42.31
4      1  2010-02-05        -298.0        42.31

### 2.5 What were average sales on holiday vs. non-holiday sales

HINT: Use GROUP BY

In [ ]:
# What were average sales on holiday vs. non-holiday sales
query = """
### FILL IN ###
"""
sql.read_sql(query, con = conn)

### 2.6 What were average sales on holiday vs. non-holiday sales when the temperature was below 32 degrees

HINT: Use JOIN, WHERE, and GROUP BY

In [ ]:
# What were average sales on holiday vs. non-holiday sales when the temperature was below 32 degrees
query = """
### FILL IN ###
"""
sql.read_sql(query, con = conn)

# EXTRA SQL PRACTICE

There are many options for extra SQL practice.

PG-Exercises:  The website [pgexercises.com](https://pgexercises.com/) is a very good site for Postgres exercsises.  Go here to get started. 

Complete 3-5 questions in each of the following.

- [Simple SQL Queries](https://pgexercises.com/questions/basic/)
- [Aggregation](https://pgexercises.com/questions/aggregates/)
- [Joins and Subqueries](https://pgexercises.com/questions/joins/)

# TOPIC REVIEW
While this was a brief introduction, databases are often at the core of any data analysis.  Most analysis starts with retrieving data from a database.

SQL is a key language that any data scientist should understand.

SELECT:  Used in every query to define the resulting columns

WHERE:  Filters rows based on a given condition

GROUP BY:  Groups rows for aggregation

JOIN:  Combines two tables based upon a given condition


Pandas can be used to access data from databases as well.  The result of the queries will end up in a Pandas dataframe.

There is much more to learn about query optimization if one dives further!